Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGeometryWithoutCutOuts(Autodesk.Revit.DB.Element)
Returns the geometry of this element, before the element is modified by
cuts like windows, doors, or other post-processing.
element:
The Element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetElementCutOuts(Autodesk.Revit.DB.Element)
Gets the curve loops corresponding to the holes in the element made by (openings, windows, doors, generic-models, sketch inner profiles).
element:
The Element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.AddValueString(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId,System.String)
Adds a string value to a built-in parameter.
element:
The element.
builtInParameter:
The built-in parameter id.
propertyValue:
The new value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal2DDirectionHandles(System.Boolean,Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handles representing the cardinal directions in 2D.
positive:
True if the handles returned should be in the positive direction, false
if the handles should be in the negative direction.
xDir:
The X direction handle.
yDir:
The Y direction handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal3DDirectionHandles(System.Boolean,Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handles representing the cardinal directions in 3D.
positive:
True if the handles returned should be in the positive direction, false
if the handles should be in the negative direction.
xDir:
The X direction handle.
yDir:
The Y direction handle.
zDir:
The Z direction handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal3DDirectionHandle(System.Int32,System.Boolean)
Obtains the handle representing one cardinal direction in 3D.
index:
The index of the handle, where 0 is X, 1 is Y and 2 is Z.
positive:
True if the handle returned should be in the positive direction, false
if the handle should be in the negative direction.
Returns:
The cached direction handle.
Since:
2026.3

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal2DDirectionHandle(System.Int32,System.Boolean)
Obtains the handle representing one cardinal direction in 2D.
index:
The index of the handle, where 0 is U and 1 is V.
positive:
True if the handle returned should be in the positive direction, false
if the handle should be in the negative direction.
Returns:
The cached direction handle.
Since:
2026.3

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal2DDirectionHandles(System.Boolean)
Obtains the handles representing the cardinal directions in 2D.
positive:
True if the handles returned should be in the positive direction, false
if the handles should be in the negative direction.
Returns:
The collection of handles.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal3DDirectionHandles(System.Boolean)
Obtains the handles representing the cardinal directions in 3D.
positive:
True if the handles returned should be in the positive direction, false
if the handles should be in the negative direction.
Returns:
The collection of handles.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal2DOriginHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handle representing the 2D origin.
origin:
The origin handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal3DOriginHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handle representing the 3D origin.
origin:
The origin handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal2DOriginHandle
Obtains the handle representing the 2D origin.
Returns:
The handle.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGlobal3DOriginHandle
Obtains the handle representing the 3D origin.
Returns:
The handle.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetRelativeLocalPlacementOffsetTransform(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the relative transform between two IfcLocalPlacement handles.
originalPlacement:
The original placement from which the result transforms coordinates and directions.
relativePlacement:
The relative placement to which the result transforms coordinates and directions.
Returns:
The transform from the original placement to the new placement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsCurveFromOtherElementSketch(Autodesk.Revit.DB.CurveElement)
Identifies if the given curve element is generated by another element's
sketch, or if it represents an independent curve element accessible directly
by the user.
curveElement:
The curve element.
Returns:
True if the curve element was generated by a sketch, false if it is
independent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLegacyCurtainSubElements(Autodesk.Revit.DB.Element)
Gets the sub elements from a legacy curtain element.
element:
The legacy curtain element.
Returns:
The element array.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetAttachedColumns(Autodesk.Revit.DB.Wall)
Obtains a list of columns known to Revit as intersecting with this wall.
pWallElem:
The wall.
Returns:
The columns found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetConnectedWalls(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.IFC.IFCConnectedWallDataLocation)
Obtains the IFC-specific information regarding the connections between this wall and other elements.
pWallElem:
The wall.
locaction:
The location on the wall from where the connections should be obtained.  This should be either
IFCConnectedWallDataLocation.Start or IFCConnectedWallDataLocation.End.
Returns:
The connection information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLegacyStairsProperties(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element,System.Int32@,System.Int32@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Returns one or more properties for legacy (created in R2012 or before) Stairs.
exporterIFC:
The exporter.
pElement:
the legacy stair.
pNumRisers:
Number of Risers in the Stair.
pNumTreads:
Number of Treads in the Stair.
pRiserHeight:
Riser Height of the risers in the Stair.
pTreadLength:
Tread length of the treads in the Stair.
pMinTreadLength:
Minimum Tread length of the treads in the Stair.
pNosingLength:
Nosing length of the treads in the Stair.
pWaistThickness:
Waist thickness of the flight of stair.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetUnscaledTransformWithoutFixOfDirection(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the unscaled transform from an IfcLocalPlacement handle without fix of direction.
exporterIFC:
The exporter.
placement:
The placement handle.
Returns:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetUnscaledTransform(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the exact unscaled transform from an IfcLocalPlacement handle.
exporterIFC:
The exporter.
placement:
The placement handle.
Returns:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetRoomBoundaryAsCurveLoopArray(Autodesk.Revit.DB.SpatialElement,Autodesk.Revit.DB.SpatialElementBoundaryOptions,System.Boolean)
Obtains the spatial element boundary curves as an array of CurveLoops, needed for processing into IFC-specific
elements later.
spatialElement:
The spatial element.
options:
The options for extraction of the boundaries.
cleanCurves:
If true, curves will be trimmed to meet their neighbors.  If false, no trimming will take place.
Returns:
The list of CurveLoops, which could be empty if the routine is unable to get the boundary curve loops.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws an exception if any of the boundary loops are invalid or degenerate.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ExportExtrudedSlabOpeningsAndReturnInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle},System.Collections.Generic.IList`1{System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop}},Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.IFC.IFCProductWrapper)
Exports the openings associated to an IfcSlab exported as an extrusion.
Returns dimensional information of the exported openings.
exporterIFC:
The ExporterIFC class.
pElem:
The base slab element.
levelInfo:
The base level information.
localPlacementAny:
The local placement of the slab.
elementSlabAnyArr:
The list of IfcSlabs created from the initial element.
extrusionLoops:
The profile curves for the extrusions, including the opening curves.
plane:
The plane of the profile curves.
pWrapper:
The product wrapper.
Returns:
Collection of opening dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ExportExtrudedSlabOpenings(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle},System.Collections.Generic.IList`1{System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop}},Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.IFC.IFCProductWrapper)
Exports the openings associated to an IfcSlab exported as an extrusion.
exporterIFC:
The ExporterIFC class.
pElem:
The base slab element.
levelInfo:
The base level information.
localPlacementAny:
The local placement of the slab.
elementSlabAnyArr:
The list of IfcSlabs created from the initial element.
extrusionLoops:
The profile curves for the extrusions, including the opening curves.
plane:
The plane of the profile curves.
pWrapper:
The product wrapper.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ExportSlabAsExtrusion(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.GeometryElement,Autodesk.Revit.DB.IFC.IFCTransformSetter,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle}@,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle}@,System.Collections.Generic.IList`1{System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop}}@,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCExtrusionCreationData}@,Autodesk.Revit.DB.Plane)
Attempts to export an IfcSlab using extrusions, clippings and openings by analyzing the geometry of the element.
Used for more advanced cases than the ExtrusionAnalyzer.
exporterIFC:
The ExporterIFC class.
pCeilingAndFloor:
The element to be exported.
pGRep:
The model geometry of the element.
pTmpTrfSetter:
The transform setter.
localPlacement:
The initial local placement based on the base level.
localPlacementAnyArr:
The local placement, potentially modified by this function.
reps:
The entity handles corresponding to the slab representations.
extrusionLoops:
The curve loops representing the profile of the extrusion.
loopExtraParams:
Extra calculated information for each of the profile loops.
plane:
The plane of the profile curves.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeRoofProjectedArea(Autodesk.Revit.DB.Element)
Returns the projected area of the room, unscaled.
pElem:
The roof.
Returns:
The projected area.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetOpeningData(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.IFC.IFCRange)
Gets the openings data from the element.
exporterIFC:
The exporter.
element:
The element.
lcs:
The local coordinate system for the extrusion.
range:
The range.  This consists of two double values representing the height in Z at the start and the end
of the range.  If the values are identical the entire element is used.
Returns:
The opening data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.IFC.ExporterIFCUtils.AddClippingsToBaseExtrusion(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.IFC.IFCRange,Autodesk.Revit.DB.IFC.IFCRange,Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCExtrusionData}@)
Processes the geometry of the wall to create an extruded area solid representing the geometry of the wall (including
any clippings imposed by neighboring elements).
exporterIFC:
The exporter.
wall:
The wall.
setterOffset:
The offset from the placement setter.
range:
The range.  This consists of two double values representing the height in Z at the start and the end
of the range.  If the values are identical the entire wall is used.
zSpan:
The overall span in Z of the wall.
baseBodyItemHandle:
The IfcExtrudedAreaSolid handle generated initially for the wall.
pCutPairOpenings:
A collection of extruded openings that can be derived from the wall geometry.
Returns:
IfcEtxtrudedAreaSolid handle.  This may be the same handle as was input, or a modified handle derived from the clipping
geometry.  If the function fails this handle will have no value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLoopsFromTopBottomFace(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Wall)
Gets the curve loop(s) that represent the bottom or top face of the wall, usable to create an extrusion for the wall geometry.
Remarks:
This function is intended to help determine if a Revit Wall can be exported as an IfcWallStandardCase.  The conditions for
exporting an IfcWallStandardCase require that the geometry of the wall be described as one profile curve loop extruded in the
Z direction, with potential clip planes and openings applied to the base geometry.  This function will use either the top
or bottom face to determine the boundary curve loop.  Regardless of whether the top or bottom face is used, the curve loop
will be located on the plane corresponding to the base of the wall.
exporterIFC:
The exporter.
wall:
The wall.
Returns:
The curve loops.  If the function has failed, this collection will be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallBaseRectangular(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.Curve)
Identifies if the wall's base can be represented by a direct thickening of the wall's base curve.
wall:
The wall.
curve:
The wall's base curve.
Returns:
True if the wall's base can be represented by a direct thickening of the wall's base curve.
False if the wall's base shape is affected by other geometry, and thus cannot be represented
by a direct thickening of the wall's base cure.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CanExportWallGeometryAsExtrusion(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.IFC.IFCRange,Autodesk.Revit.DB.Curve)
Identifies if the base geometry of the wall can be represented as an extrusion.
element:
The wall or in-place wall element.
range:
The range.  This consists of two double values representing the height in Z at the start and the end
of the range.  If the values are identical the entire wall is used.
curve:
The wall's base curve.
Returns:
True if the wall export can be made in the form of an extrusion, false if the
geometry cannot be assigned to an extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetGeometryFromInplaceWall(Autodesk.Revit.DB.FamilyInstance)
Obtains a special snapshot of the geometry of an in-place wall element suitable for export.
pFamInstWallElem:
The in-place wall instance.
Returns:
The in-place wall geometry.  Returns null if there is no special
geometry for the wall needed for export; the standard geometry of the wall can be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetElevationProfile(Autodesk.Revit.DB.Wall)
Obtains the curve loops which bound the wall's elevation profile.
pVWall:
The wall.
Returns:
The collection of curve loops.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The wall does not have an elevation profile.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.HasElevationProfile(Autodesk.Revit.DB.Wall)
Identifies if the wall has a sketched elevation profile.
pVWall:
The wall.
Returns:
True if the wall has a sketch elevation profile, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetWallTrimmedCurve(Autodesk.Revit.DB.Wall)
Obtains the curve of the wall trimmed or extended according to the end conditions of the wall.
pVWall:
The wall.
Returns:
The trimmed or extended curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetWallBaseOffset(Autodesk.Revit.DB.Wall)
Obtains the base offset of the wall.
wall:
The wall.
Returns:
The base offset of the wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallCompletelyClipped(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCRange)
Determines if the input wall is completely removed by interaction with other elements
within the given range.
pVWall:
The wall.
exporterIFC:
The exporter.
range:
The range.  This consists of two double values representing the height in Z at the start and the end
of the range.  If the values are identical the entire wall is used.
Returns:
True if the wall should be ignored within the given range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.AreSolidsEqual(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Transform@)
Determines whether two solids are identical, potentially offset from each other.
first:
The first solid.
second:
The second solid
trf:
The offset transform
Returns:
True if they are identical, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetTransformForDoorOrWindow(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.FamilySymbol,System.Boolean,System.Boolean)
Obtains the transform for the door or window instance.
familyInstance:
The family instance.
familySymbol:
The family symbol.
flippedX:
Is the door or window flipped in X?
flippedY:
Is the door or window flipped in Y?
Returns:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolWidth(Autodesk.Revit.DB.FamilySymbol)
Obtains the minimum width of the given FamilySymbol.
symbol:
The family symbol.
Returns:
The minimum width.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolHeight(Autodesk.Revit.DB.FamilySymbol)
Obtains the minimum height of the given FamilySymbol.
symbol:
The family symbol.
Returns:
The minimum height.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.UsesInstanceGeometry(Autodesk.Revit.DB.FamilyInstance)
Identifies if the family instance has its own geometry, or uses the symbol's geometry with a transform.
Remarks:
A Family Instance can have its own copy of geometry, or use the symbol's geometry with a transform.
This method identifies the source of this family instance's geometry.
familyInstance:
The family instance.
Returns:
True if the instance has its own geometry.  False if the symbol's geometry is used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetOriginalSymbol(Autodesk.Revit.DB.FamilyInstance)
Returns the original family symbol of this family instance, before the instance is modified by
joins, cuts, coping, extensions, or other post-processing.
familyInstance:
The FamilyInstance.
Returns:
The original FamilySymbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CollectGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCGeometryInfo,Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.Transform)
Collects all the target geometry from the input geometry object and adds it as IFC handles
to the IFCInfo.
Remarks:
The type of geometry collected is determined by the method of creation for the IFCGeometryInfo.
exporterIFC:
The exporter.
geometryInfo:
The container object which collects the geometry.
gNode:
The geometry object to be processed.
offset:
The offset to apply to each of the collected geometry handles.
forceVisible:
True to process geometry which is not set as visible.  False to only process visible geometry.
transform:
An overall transform to apply to each of the collected geometry handles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CollectGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCGeometryInfo,Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.XYZ,System.Boolean)
Collects all the target geometry from the input geometry object and adds it as IFC handles
to the IFCInfo.
Remarks:
The type of geometry collected is determined by the method of creation for the IFCGeometryInfo.
exporterIFC:
The exporter.
geometryInfo:
The container object which collects the geometry.
gNode:
The geometry object to be processed.
offset:
The offset to apply to each of the collected geometry handles.
forceVisible:
True to process geometry which is not set as visible.  False to only process visible geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.TransformAndScaleVector(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.XYZ)
Converts a vector from global Revit coordinates to current IFC coordinates, including scale.
exporterIFC:
The exporter.
origVector:
The original vector.
Returns:
The transformed and scaled point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.TransformAndScalePoint(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.XYZ)
Converts a point from global Revit coordinates to current IFC coordinates, including scale.
exporterIFC:
The exporter.
origPt:
The original point.
Returns:
The transformed and scaled point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ValidateCurveLoops(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ)
Does validity checks on a list of curve loops to ensure that they are all co-planar, closed, and properly oriented.
curveLoops:
The loops to check.
extrDirVec:
The normal.
Returns:
returns the curve loops properly oriented, if possible.  If not, the return contains no loops.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsCurveLoopConvexWithOpenings(Autodesk.Revit.DB.CurveLoop,Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.IFC.IFCRange,System.Boolean@)
Checks if the region bounded by the input curve loop can be represented as the subtraction of 0 or more convex polygons from a base convex polygon.
Remarks:
This function is intended to be used to determine if the geometry of a wall with an elevation profile can be successfully represented
as a vertical extrusion with one or more openings removed.
If this function is to return true, the subtracting polygons must each have at least one edge coincident with the base convex polygon.
Before the check is performed, this input curve will be trimmed by the range extents of the wall, if any.
inputCurveLoop:
The input curve loop.  It is intended that this curve loop have been obtained from the elevation profile of a wall.
wall:
The wall from which the curve loop was obtained.
range:
The range extents of the wall.
loopIsDegenerate:
If the function returns false but this returns true, the loop could be obtained but was degenerate.  Thus there is no extrusion
that can be produced.
Returns:
True if the region can be represented by a boolean combination of polygons, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SortFaceEdges(Autodesk.Revit.DB.Face)
Sorts the edges of a face such that the outer edge loops and their corresponding inner edge loops are
separated.
Remarks:
Each entry of the array represents an array of indices, where the first index corresponds to an
outer edge loop and the rest of the indices correspond to 0 or more inner edge loops contained inside
the outer edge loop. Loops are assumed to be non-intersecting, and there will be no nesting of inner loops
(that is, an inner loop of an inner loop is another outer loop).
The indices correspond to entries in the collection of edge loops returned by Face.EdgeLoops.
face:
The face.
Returns:
The list of outer edge loops and their corresponding inner edge loops, by their index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.IFC.ExporterIFCUtils.SortCurveLoops(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Sorts a set of curve loops such that outer and inner loops are separated.
Remarks:
Outer loops are separated and inner loops are grouped according to their outer loop. Loops are assumed to be non-intersecting,
and there will be no nesting of inner loops (that is, an inner loop of an inner loop is another outer loop).
This function is intended to be used on planar loops only, and will fail otherwise.
loops:
The curve loops.
Returns:
The sorted collection of loops.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLegacyStairOrRampComponents(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element)
Gets the components of a stair or ramp.
exporterIFC:
The exporter.
element:
The legacy stair or ramp element.
Returns:
The LegacyStairOrRamp that contains the components. NULL means the components can't be determined.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeAreaOfCurveLoops(System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Computes total area of the list of curve loops.  If the area cannot be calculated,
returns 0.0.
Remarks:
All curve loops in the list must be planar and lie in the same plane.
Returns:
Computed area.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFCUtils.IsWallJoinedToTop(Autodesk.Revit.DB.Wall)
Checks if wall is joined to top.
wall:
The wall.
Returns:
True if wall is joined to top, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.EndExportInternal(Autodesk.Revit.DB.IFC.ExporterIFC)
Use the internal Revit implementation to relate elements at the end of export.
exporterIFC:
The exporter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateSubElementGUID(Autodesk.Revit.DB.Element,System.Int32)
Creates a consistent GUID for an IFC entity related to a Revit element.
A "related" sub-element is one that is unique for a given type of element, and can
therefore by identified by a simple index value (e.g. PSet_Wall_Common property set for a wall.)
The index value 0 is reserved, as this would generate the GUID of the element itself.
A listing of known sub-elements is contained in IFCSubElementEnums.cs; it is
expected that this list would be maintained up-to-date, instead of passing arbitrary values
into this function.
pElement:
The element.
subElementIndex:
The global index for this sub-element.
Returns:
The guid string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateAlternateGUID(Autodesk.Revit.DB.Element)
Creates a GUID for the given element.
pElement:
The element.
Returns:
The guid string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateProjectLevelGUID(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType)
Creates a GUID from Revit project for given GUIDType.
document:
The document.
guidType:
The GUID type.
Returns:
The guid string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.CreateGUID
Creates a randomized GUID.
Returns:
The guid string.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetInstanceCutoutFromWall(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.XYZ@)
Gets the curve loop corresponding to the hole in the wall made by the instance.
pADoc:
The document.
pVWall:
The host wall.
pFamInst:
The hosted instance.
pCutDir:
The direction of the hole relative to the location of the curve loop.
Returns:
The opening in the wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetDoor2DArcsFromFamily(Autodesk.Revit.DB.Family)
Gets the arcs associated with the plan view of a door.
pFam:
The family.
Returns:
The arcs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils.ComputeSubcomponents(Autodesk.Revit.DB.HostObject)
Splits a roof or floor element composed of planar surfaces into a set of roughly vertical extruded loops of
uniform depth if possible.
roofOrFloor:
The roof or floor.
Returns:
A collection of computed components.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The host object roofOrFloor must be a floor or a non face-based roof.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The roof or floor cannot be split into subcomponents by this routine.  Possible reasons are, among others:
(1) the roof or floor contains non-planar surfaces, (2) the roof or floor cannot be divided into sub-components
of equal thickness, or (3) the roof subcomponents contain inner boundary loops.
Since:
2016

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetRoofComponents(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.RoofBase)
Gets the components of roof slabs.
exporterIFC:
The exporter.
roof:
The roof element.
Returns:
The roof components.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetLevelIdByHeight(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Element)
Gets the level if by the height of the element.
exporterIFC:
The exporter.
elem:
The element.
Returns:
The level id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFCUtils
A class that contains utilities needed to implement Revit's version of the IFC export client application.
Remarks:
This class contains special API utilities needed to enable the implementation of the client application
for IFC export.  Some of these utilities will be needed temporarily while the code for IFC export is
migrated into the export client.  These temporary interfaces are likely to change in upcoming Revit
releases.
Since:
2012